[AdvGeneralM1 X2CharacterTemplate]
strCharacterName="Полевой командир Адвента"
strAcquiredText="Младший чин верховного командования ВС Адвента. Может вызывать подкрепления врага и неплохо обращается со своими пистолетом."

[AdvGeneralM2 X2CharacterTemplate]
strCharacterName="Генерал-Майор Адвента"
strAcquiredText="Средний офицерский ранг верховного командования ВС Адвента. Может вызывать подкрепления врага и неплохо обращается со своими пистолетом."

[AdvGeneralM3 X2CharacterTemplate]
strCharacterName="Генерал-Лейтенант Адвента"
strAcquiredText="Высокий офицерский ранг верховного командования ВС Адвента. Может вызывать крупные подкрепления врага и неплохо обращается со своими пистолетом."

[AdvGeneralM2B X2CharacterTemplate]
strCharacterName="Генерал-Полковник Адвента"
strAcquiredText="Элитный офицер верховного командования ВС Адвента. Может вызывать крупные подкрепления врага и иммет высокие боевые показатели во всех дисциплинах."

[AdvGeneralM3B X2CharacterTemplate]
strCharacterName="Генерал Армии Адвента"
strAcquiredText="Элитный и главный офицер верховного командования ВС Адвента. Может вызывать крупные подкрепления врага и крайне опасен в бою. Лучше не пытаться его окружать."

[AdvHonorGuardM2 X2CharacterTemplate]
strCharacterName="Телохранитель Адвента"
strAcquiredText="Телохранитель офицеров Адвента. Прекрасно обучен сражаться как в ближнем, так и в дальнем бою. Вооружен особо точной лазерной винтовкой и плазменным резаком."

[AdvHonorGuardM3 X2CharacterTemplate]
strCharacterName="Элитный Телохранитель Адвента"
strAcquiredText="Элитный телохранитель офицеров Адвента. Прекрасно обучен сражаться как в ближнем, так и в дальнем бою. Вооружен особо точной лазерной винтовкой и плазменным резаком."

[AdvHonorGuardLMGM3 X2CharacterTemplate]
strCharacterName="Заслуженный Телохранитель Адвента"
strAcquiredText="Лучший из лучших телохранителей Адвента. Прекрасно обучен сражаться как в ближнем, так и в дальнем бою. Вооружен особо точным лазерным пулеметом и плазменным резаком."

[AdvHonorGuardSwordM2 X2WeaponTemplate]
FriendlyName="Лазерная сабля Адвента"

[AdvHonorGuardSwordM3 X2WeaponTemplate]
FriendlyName="Лазерная сабля Адвента"

[AdvGeneralLaserM2_WPN X2WeaponTemplate]
FriendlyName="Лазерная винтовка Адвента"
FriendlyNamePlural="Лазерные винтовки Адвента"
BriefSummary="Продвинутая лазерная винтовка ВС Адвента. Мощная и точная, она выдается только особо отличившимся бойцам пришельцев."
TacticalText="<Bullet/> Лазерная винтовка адвента превосходит их обычные магнитные аналоги.\n<Bullet/> Обладает меньшей отдачей и повышенной точностью."
AbilityDescName="assault rifle"

[AdvGeneralLaserM3_WPN X2WeaponTemplate]
FriendlyName="Лазерная винтовка Адвента"
FriendlyNamePlural="Лазерные винтовки Адвента"
BriefSummary="Продвинутая лазерная винтовка ВС Адвента. Мощная и точная, она выдается только особо отличившимся бойцам пришельцев."
TacticalText="<Bullet/> Лазерная винтовка адвента превосходит их обычные магнитные аналоги.\n<Bullet/> Обладает меньшей отдачей и повышенной точностью."
AbilityDescName="assault rifle"

[AdvLaserRifleM2_WPN X2WeaponTemplate]
FriendlyName="Лазерная винтовка Адвента"
FriendlyNamePlural="Лазерные винтовки Адвента"
BriefSummary="Продвинутая лазерная винтовка ВС Адвента. Мощная и точная, она выдается только особо отличившимся бойцам пришельцев."
TacticalText="<Bullet/> Лазерная винтовка адвента превосходит их обычные магнитные аналоги.\n<Bullet/> Обладает меньшей отдачей и повышенной точностью."
AbilityDescName="assault rifle"

[AdvLaserRifleM3_WPN X2WeaponTemplate]
FriendlyName="Лазерная винтовка Адвента"
FriendlyNamePlural="Лазерные винтовки Адвента"
BriefSummary="Продвинутая лазерная винтовка ВС Адвента. Мощная и точная, она выдается только особо отличившимся бойцам пришельцев."
TacticalText="<Bullet/> Лазерная винтовка адвента превосходит их обычные магнитные аналоги.\n<Bullet/> Обладает меньшей отдачей и повышенной точностью."
AbilityDescName="assault rifle"

[AdvLaserLMGM3_WPN X2WeaponTemplate]
FriendlyName="Лазерная пушка Адвента"
FriendlyNamePlural="Лазерные пушки Адвента"
BriefSummary="Продвинутая лазерная пушка ВС Адвента. Мощная и точная, она выдается только особо отличившимся бойцам пришельцев."
TacticalText="<Bullet/> Лазерная пушка адвента превосходит их обычные магнитные аналоги.\n<Bullet/> Обладает меньшей отдачей и повышенной точностью."
AbilityDescName="cannon"

[AdvGeneralPistolM1_WPN X2WeaponTemplate]
FriendlyName="Пистолет генерала Адвента"
FriendlyNamePlural="Пистолеты генерала Адвента"
BriefSummary="Пистолет Генерала АДВЕНТА, сочетает в себе убойную мощь магнитного оружия и точность лазерного луча. Это лучшее ручное оружие пришельцев."
TacticalText="<Bullet/> Пистолеты Генералов Адвента — одни из самых мощных пистолетов пришельцев.\n<Bullet/> Стрельба расходует только 1 действие."
AbilityDescName="pistol"

[AdvGeneralPistolM2_WPN X2WeaponTemplate]
FriendlyName="Пистолет генерала Адвента"
FriendlyNamePlural="Пистолеты генерала Адвента"
BriefSummary="Пистолет Генерала АДВЕНТА, сочетает в себе убойную мощь магнитного оружия и точность лазерного луча. Это лучшее ручное оружие пришельцев."
TacticalText="<Bullet/> Пистолеты Генералов Адвента — одни из самых мощных пистолетов пришельцев.\n<Bullet/> Стрельба расходует только 1 действие."
AbilityDescName="pistol"

[AdvGeneralPistolM3_WPN X2WeaponTemplate]
FriendlyName="Пистолет генерала Адвента"
FriendlyNamePlural="Пистолеты генерала Адвента"
BriefSummary="Пистолет Генерала АДВЕНТА, сочетает в себе убойную мощь магнитного оружия и точность лазерного луча. Это лучшее ручное оружие пришельцев."
TacticalText="<Bullet/> Пистолеты Генералов Адвента — одни из самых мощных пистолетов пришельцев.\n<Bullet/> Стрельба расходует только 1 действие."
AbilityDescName="pistol"

[GoldenPistol_WPN X2WeaponTemplate]
FriendlyName="<font color='#E1C20D'>Элитный золотой пистолет Адвента</font>"
FriendlyNamePlural="<font color='#E1C20D'>Элитный золотой пистолет Адвента</font>"
BriefSummary="Пистолет Генерала АДВЕНТА, сочетает в себе убойную мощь магнитного оружия и точность лазерного луча. Это лучшее ручное оружие пришельцев и похоже его редкий фамильный вариант, принадлежавший какой-то важной шишке Адвента."
TacticalText="<Bullet/> Пистолеты Генералов Адвента — одни из самых мощных пистолетов пришельцев.\n<Bullet/> Имеет повышенную точность и шанс критического попадания. \n<Bullet/> Каждое убийство повышает шанс последующего критического попадания. \n<Bullet/> Это крайне редкая вещь. Уверен им очень заинересуются на черном рынке..."
AbilityDescName="pistol"


[CallAdvReinforcementsM1 X2AbilityTemplate]
LocFriendlyName="Подкрепление Адвента"
LocLongDescription="Вызывает подкрепление сил Адвента"
LocHelpText="Вызывает подкрепление сил Адвента"
LocFlyOverText="Мне нужно подкрепление!"

[CallAdvReinforcementsM2 X2AbilityTemplate]
LocFriendlyName="Подкрепление Адвента"
LocLongDescription="Вызывает подкрепление сил Адвента"
LocHelpText="Вызывает подкрепление сил Адвента"
LocFlyOverText="Мне нужно подкрепление! Сейчас!"

[CallAdvReinforcementsM3 X2AbilityTemplate]
LocFriendlyName="Подкрепление Адвента"
LocLongDescription="Вызывает подкрепление сил Адвента"
LocHelpText="Вызывает подкрепление сил Адвента"
LocFlyOverText="Мне нужно подкрепление! Все что есть!"

[CallAdvReinforcementsM2B X2AbilityTemplate]
LocFriendlyName="Подкрепление Адвента"
LocLongDescription="Вызывает подкрепление сил Адвента"
LocHelpText="Вызывает подкрепление сил Адвента"
LocFlyOverText="Мне нужно подкрепление! Сейчас же бл...!"

[CallAdvReinforcementsM3B X2AbilityTemplate]
LocFriendlyName="Подкрепление Адвента"
LocLongDescription="Вызывает подкрепление сил Адвента"
LocHelpText="Вызывает подкрепление сил Адвента"
LocFlyOverText="Мне нужно подкрепление! Б*** срочно у**** х****!"

[GeneralM1Buff X2AbilityTemplate]
LocFriendlyName="Призыв генерала"
LocLongDescription="Генерал призывает и направляет в бой всех бойцов Адвента поблизости."
LocHelpText="Генерал призывает и направляет в бой всех бойцов Адвента поблизости. Дает +5 защиты и +10 воли всем бойцам Адвента поблизости. Длится 2 хода."
LocFlyOverText="Старейшины направят нас! Сплотить ряды!"

[GeneralM2Buff X2AbilityTemplate]
LocFriendlyName="Призыв генерала"
LocLongDescription="Генерал призывает и направляет в бой всех бойцов Адвента поблизости."
LocHelpText="Генерал призывает и направляет в бой всех бойцов Адвента поблизости. Дает +10 защиты, +5 точности и +15 воли всем бойцам Адвента поблизости. Длится 2 хода."
LocFlyOverText="Старейшины направят нас! В атаку!"

[GeneralM3Buff X2AbilityTemplate]
LocFriendlyName="Призыв генерала"
LocLongDescription="Генерал призывает и направляет в бой всех бойцов Адвента поблизости."
LocHelpText="Генерал призывает и направляет в бой всех бойцов Адвента поблизости. Дает +15 защиты, +10 точности, +2 мобильности и +20 воли всем бойцам Адвента поблизости. Длится 2 хода."
LocFlyOverText="Старейшины направят нас! Уничтожить их!"

[HGDemolitionShot X2AbilityTemplate]
LocFriendlyName="Подрыв"
LocLongDescription="Разрушительный выстрел, разрушающий или серьезно повреждающий укрытие. Не наносит урона самой цели."
LocHelpText="Разрушительный выстрел, разрушающий или серьезно повреждающий укрытие. Не наносит урона самой цели."
LocFlyOverText="Подрыв"
LocPromotionPopupText="<Bullet/> Подрыв требует <Ability:SelfAmmoCost/> боезапаса и перезаряжается <Ability:SelfCooldown/> хода.<br/><Bullet/> Разрушает или серьезно повреждает укрытие, но не наносит урона самой цели.<br/>"
LocMissMessage="Промах!"

[HonorGuardLaserSlash X2AbilityTemplate]
LocFriendlyName="Плазменный порез"
LocLongDescription="Особый удар в ближнем бою, который может вызвать эффекты горения и дезориентации при попадании."
LocHelpText="Особый удар в ближнем бою, который может вызвать эффекты горения и дезориентации при попадании."
LocFlyOverText="Плазменный порез"


